app/views/perros/registrar_perro.html.erb

            <%= f.label :raza_id, "Raza" %>
<%= f.collection_select :raza_id, Raza.all, :id, :nombre, { prompt: "Seleccione una raza" }, class: "form-control" %>
---
SELECT "razas".* FROM "razas"