app/views/historial_turnos/hoy.html.erb


                        <% if turno.perro.user.descuento.present? && turno.perro.user.descuento > 0 %>
---
SELECT "perros".* FROM "perros" WHERE "perros"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]