app/views/historial_turnos/hoy.html.erb

SELECT "vacunas".* FROM "vacunas"
---
                                                <%= vaccine_form.label :vacuna_id, "Vacuna", class: "form-label" %>
                                                <%= vaccine_form.collection_select :vacuna_id, Vacuna.all, :id, :tipo, { prompt: "Seleccionar vacuna" }, class: "form-control" %>