app/views/historial_turnos/solicitar_turno.html.erb

                <%= f.label :tipo_turno_id, "Tipo de turno" %>
                <%= f.collection_select :tipo_turno_id, TipoTurno.all, :id, :tipo, { prompt: "Seleccione una raza" }, class: "form-control" %>
---
SELECT "tipo_turnos".* FROM "tipo_turnos"

                <%= f.label :perro, "Seleccionar Perro" %>
                <%= f.collection_select :perro_id, current_user.perros, :id, :nombre, { prompt: "Seleccione un perro" }, class: "form-control" %>                <%= f.object.errors.full_messages_for(:perro_id).join(', ') if f.object.errors[:perro_id].any? %>
---
SELECT "perros".* FROM "perros" WHERE "perros"."user_id" = ?  [["user_id", 92]]