app/views/user_search/perros.html.erb

              <h4>Consultas</h4>
              <% perro.historial_turnos.each do |historial_turno| %>
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."perro_id" = ?  [["perro_id", 7]]

                <% perro.historial_turnos.each do |historial_turno| %>
                    <% vaccines = Vaccine.where(historial_turno_id: historial_turno.id) %>
---
SELECT "vaccines".* FROM "vaccines" WHERE "vaccines"."historial_turno_id" = ?  [["historial_turno_id", 1]]


                    <% deworm = Deworm.where(historial_turno_id: historial_turno.id) %>
---
SELECT "deworms".* FROM "deworms" WHERE "deworms"."historial_turno_id" = ?  [["historial_turno_id", 1]]