app/controllers/campaigns_controller.rb

SELECT "campaigns".* FROM "campaigns" WHERE (fecha >= '2023-11-26' AND activa = 1) ORDER BY "campaigns"."fecha" ASC
---
    def index
        @campaigns = Campaign.where('fecha >= ? AND activa = ?', Date.current, true).order(fecha: :asc)

INSERT INTO "campaigns" ("nombre", "descripcion", "monto", "imagen", "fecha", "created_at", "updated_at", "activa") VALUES (?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
      def create
        @campaign = Campaign.new(campaign_params)

        if @campaign.save

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tarjeta".* FROM "tarjeta" WHERE "tarjeta"."numero" = ? LIMIT ?  [["numero", 6155151551], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "donante" = ? WHERE "users"."id" = ?  [["updated_at", "2023-11-29 03:23:43.800656"], ["donante", 1], ["id", 83]]
UPDATE "tarjeta" SET "saldo" = ?, "updated_at" = ? WHERE "tarjeta"."id" = ?  [["saldo", 9600], ["updated_at", "2023-11-27 23:19:50.536388"], ["id", 2]]
---
    def pay
      @campaign = Campaign.find(params[:id])
      Rails.logger.debug(params.inspect)

      if request.post?
        if params.dig(:tarjeta).present?
          @tarjeta_params = tarjeta_params
          @tarjeta = Tarjeta.find_by(numero: @tarjeta_params[:numero])

          if @tarjeta.present? && @tarjeta.valid? &&
             @tarjeta.codigo == @tarjeta_params[:codigo].to_i &&
             @tarjeta.vencimiento.to_date == @tarjeta_params[:vencimiento].to_date &&
             @tarjeta.nombre == @tarjeta_params[:nombre] &&
             @tarjeta.dni == @tarjeta_params[:dni].to_i

            if @tarjeta_params[:monto_temporal].to_i > @tarjeta.saldo
              flash.now[:error] = 'El monto de la donación excede el saldo de la tarjeta.'
              render action: :pay, locals: { tarjeta: @tarjeta_params }
            elsif @tarjeta_params[:monto_temporal].to_i > @campaign.monto
              flash.now[:error] = 'El monto de la donación excede el monto total de la campaña.'
              render action: :pay, locals: { tarjeta: @tarjeta_params }
            else
              # Lógica para realizar la donación, actualizar el saldo, etc.
              # ...
              current_user.update(donante: true) if user_signed_in?
              @tarjeta.saldo -= @tarjeta_params[:monto_temporal].to_i
              @tarjeta.save

UPDATE "campaigns" SET "nombre" = ?, "updated_at" = ? WHERE "campaigns"."id" = ?  [["nombre", "Boca"], ["updated_at", "2023-11-28 00:00:58.842558"], ["id", 6]]
---
    def update
      if @campaign.update(campaign_params)

UPDATE "campaigns" SET "monto" = ?, "fecha" = ?, "updated_at" = ? WHERE "campaigns"."id" = ?  [["monto", 1231], ["fecha", "4322-11-11"], ["updated_at", "2023-11-29 03:37:05.050882"], ["id", 9]]
---
    def destroy
        @campaign.update(activa: false)

SELECT "campaigns".* FROM "campaigns" WHERE (nombre LIKE '%%' AND activa = 1 AND fecha >= '2023-11-26')
---
      def search
        query = params[:query]
        @campaigns = Campaign.where('nombre LIKE ? AND activa = ? AND fecha >= ?', "%#{query}%", true, Date.current)

SELECT "campaigns".* FROM "campaigns" WHERE "campaigns"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_campaign
      @campaign = Campaign.find(params[:id])