app/controllers/dashboard_controller.rb

  def eliminar_usuario
    # Lógica para eliminar usuarios si es necesario
    # ...

    # Obtén la lista de usuarios habilitados
    @usuarios = User.where(habilitado: true)
---
SELECT "users".* FROM "users" WHERE "users"."habilitado" = ?  [["habilitado", 1]]

def eliminar
  @usuario = User.find(params[:id])
  @usuario.update(habilitado: false)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 86], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "habilitado" = ? WHERE "users"."id" = ?  [["updated_at", "2023-11-15 14:56:50.897264"], ["habilitado", 0], ["id", 86]]