app/controllers/historial_turnos_controller.rb

    def new
        @turno = HistorialTurno.new
        @vacunas = Vacuna.all
        @tipo = TipoTurno.all
---
SELECT "tipo_turnos".* FROM "tipo_turnos"

    def create
        @turno = HistorialTurno.new(turno_parametros)
        @turno.condition = Condition.find_by(id: 1)

        if @turno.save
            SolicitarTurnoMailer.with(turno: @turno).confirm.deliver_later #Lo envia de manera asincrona
---
SELECT "conditions".* FROM "conditions" WHERE "conditions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tipo_turnos".* FROM "tipo_turnos" WHERE "tipo_turnos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "historial_turnos" ("franja", "tipo_turno_id", "created_at", "updated_at", "perro_id", "condition_id", "texto", "consulta", "fecha", "hora", "monto") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"

    def pendientes
        @turnos_pendientes = HistorialTurno.where(condition_id: 1, hora: nil)
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."condition_id" = ? AND "historial_turnos"."hora" IS NULL  [["condition_id", 1]]

    def agregar_horario
        @turno = HistorialTurno.find(params[:id])
        new_hora = params[:historial_turno][:hora]

        if new_hora.present?
            # Parsea la hora en un objeto Time (por ejemplo, 09:09 AM)
            @turno.update(hora: new_hora, condition_id: 2)
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "historial_turnos" SET "updated_at" = ?, "hora" = ?, "condition_id" = ? WHERE "historial_turnos"."id" = ?  [["updated_at", "2023-11-29 02:54:14.760965"], ["hora", "2000-01-01 12:12:00"], ["condition_id", 2], ["id", 84]]

    def agregar_texto
        @turno = HistorialTurno.find(params[:id])
        new_texto = params[:historial_turno][:texto]

        if new_texto.present?
            @turno.update(texto: new_texto, condition_id: 3)
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "historial_turnos" SET "updated_at" = ?, "condition_id" = ?, "texto" = ? WHERE "historial_turnos"."id" = ?  [["updated_at", "2023-11-29 02:27:04.531022"], ["condition_id", 3], ["texto", "hola"], ["id", 4]]

    def confirmados
        @turnos_confirmados = HistorialTurno.where(condition_id: 2)
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."condition_id" = ?  [["condition_id", 2]]

    def cancelar_turno
        @turno = HistorialTurno.find(params[:id])
        @turno.update(condition_id: 3) # Actualiza el condition_id a 3 para "cancelado"
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "historial_turnos" SET "updated_at" = ?, "condition_id" = ? WHERE "historial_turnos"."id" = ?  [["updated_at", "2023-11-29 02:27:16.550714"], ["condition_id", 3], ["id", 1]]

    def hoy
        @turnos_confirmados = HistorialTurno.where(fecha: Date.tomorrow, condition_id: 2)
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."fecha" = ? AND "historial_turnos"."condition_id" = ? ORDER BY "historial_turnos"."fecha" ASC  [["fecha", "2023-11-30"], ["condition_id", 2]]

    def agregar_consulta
        @turno = HistorialTurno.find(params[:id])
        new_texto = params[:historial_turno][:consulta]

        if new_texto.present?
          # Actualizar los atributos del turno
          @turno.update(consulta: new_texto, condition_id: 4, monto: params[:historial_turno][:monto])

          # Si el tipo de turno es 1, también maneja la creación de Vaccine
          if @turno.tipo_turno_id == 1
            vaccine_params = params.require(:historial_turno).require(:vaccine).permit(:peso, :vacuna_id)
            @vaccine = Vaccine.new(vaccine_params)
            @vaccine.historial_turno = @turno
            @vaccine.save
          end

          if @turno.tipo_turno_id == 4
            deworm_params = params.require(:historial_turno).require(:deworm).permit(:cantidad)
            @deworm = Deworm.new(deworm_params)
            @deworm.historial_turno = @turno
            @deworm.save
---
SELECT "historial_turnos".* FROM "historial_turnos" WHERE "historial_turnos"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
UPDATE "historial_turnos" SET "updated_at" = ?, "condition_id" = ?, "consulta" = ?, "monto" = ? WHERE "historial_turnos"."id" = ?  [["updated_at", "2023-11-29 04:49:46.394795"], ["condition_id", 4], ["consulta", "asdasd"], ["monto", 123123], ["id", 23]]
INSERT INTO "vaccines" ("vacuna_id", "peso", "texto", "historial_turno_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["vacuna_id", 1], ["peso", 0], ["texto", nil], ["historial_turno_id", 23], ["created_at", "2023-11-29 04:49:46.400725"], ["updated_at", "2023-11-29 04:49:46.400725"]]
INSERT INTO "deworms" ("cantidad", "texto", "historial_turno_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["cantidad", 3], ["texto", nil], ["historial_turno_id", 19], ["created_at", "2023-11-29 04:30:26.990125"], ["updated_at", "2023-11-29 04:30:26.990125"]]