app/controllers/perros_controller.rb

SELECT "razas".* FROM "razas"
---
  def new
    @perro = Perro.new
    @razas = Raza.all || []

SELECT "users".* FROM "users" WHERE "users"."dni" = ? LIMIT ?  [["dni", 1234512345], ["LIMIT", 1]]
INSERT INTO "perros" ("nombre", "edad", "fecha_nacimiento", "sexo", "user_id", "created_at", "updated_at", "raza_id", "historial_anterior") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @perro = Perro.new(perro_parametros)

    # Buscar el usuario por DNI
    if params[:perro] && params[:perro][:dueño_dni]
      usuario = User.find_by(dni: params[:perro][:dueño_dni])

      if usuario
        # Asignar el id del usuario encontrado al user_id del perro
        @perro.user_id = usuario.id

        if @perro.save

SELECT "perros".* FROM "perros" WHERE "perros"."user_id" = ?  [["user_id", 86]]
SELECT "razas".* FROM "razas"
---
  def mis_perros
    @mis_perros = Perro.where(user_id: current_user.id)
    @razas = Raza.all

SELECT "perros".* FROM "perros" WHERE "perros"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "perros" SET "nombre" = ?, "updated_at" = ? WHERE "perros"."id" = ?  [["nombre", "mandyu"], ["updated_at", "2023-11-28 04:05:03.243046"], ["id", 7]]
SELECT "perros".* FROM "perros" WHERE "perros"."user_id" = ?  [["user_id", 83]]
SELECT "razas".* FROM "razas"
---
def update
  @perro = Perro.find(params[:id])

  # Aplicar downcase al nombre antes de actualizar el perro
  params[:perro][:nombre] = params[:perro][:nombre].downcase if params[:perro][:nombre].present?

  if @perro.update(perro_params)
    redirect_to mis_perros_path, notice: 'Modificación exitosa.'
  else
    # Si la actualización falla debido a la validación del nombre único,
    # redireccionar con el mensaje personalizado.
    if @perro.errors[:nombre].include?('ya está en uso para este usuario')
      redirect_to mis_perros_path, notice: 'Ya existe un perro con ese nombre.'
    else
      @mis_perros = Perro.where(user_id: current_user.id)
      @razas = Raza.all