app/controllers/servicios_controller.rb

      def cuidadores
        @servicios = Servicio.all
---
SELECT "servicios".* FROM "servicios"

      def paseadores
        @servicios = Servicio.all
---
SELECT "servicios".* FROM "servicios"