app/controllers/servicios_controller.rb

INSERT INTO "servicios" ("nombre", "apellido", "dni", "zona", "mail", "tipo", "horarios", "created_at", "updated_at", "habilitado") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def guardar_cuidador
    nombre = params[:nombre]
    apellido = params[:apellido]
    zona = params[:zona]
    horarios = params[:horarios]
    dni = params[:dni]
    mail = params[:mail]

    servicio = Servicio.new(
      nombre: nombre,
      apellido: apellido,
      zona: zona,
      horarios: horarios,
      dni: dni,
      mail: mail,
      habilitado: 0,
      tipo: "1"
    )
    if servicio.save

SELECT "servicios".* FROM "servicios" WHERE "servicios"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "servicios" SET "updated_at" = ?, "habilitado" = ? WHERE "servicios"."id" = ?  [["updated_at", "2023-11-29 03:50:55.523492"], ["habilitado", 1], ["id", 12]]
---
  def destroy
    @servicio = Servicio.find(params[:id])
    @servicio.update(habilitado: 1)

SELECT "servicios".* FROM "servicios" WHERE "servicios"."tipo" = ? AND "servicios"."habilitado" = ?  [["tipo", "1"], ["habilitado", 0]]
---
  def cuidadores
    @servicios = Servicio.where(tipo: "1", habilitado: 0)

SELECT "servicios".* FROM "servicios" WHERE "servicios"."tipo" = ? AND "servicios"."habilitado" = ?  [["tipo", "2"], ["habilitado", 0]]
---
  def paseadores
    @servicios = Servicio.where(tipo: "2", habilitado: 0)

INSERT INTO "servicios" ("nombre", "apellido", "dni", "zona", "mail", "tipo", "horarios", "created_at", "updated_at", "habilitado") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def guardar_paseador
    # Recuperar los datos del formulario
    nombre = params[:nombre]
    apellido = params[:apellido]
    zona = params[:zona]
    horarios = params[:horarios]
    dni = params[:dni]
    mail = params[:mail]

    # Crear un nuevo objeto Servicio con los datos del formulario
    servicio = Servicio.new(
      nombre: nombre,
      apellido: apellido,
      zona: zona,
      horarios: horarios,
      dni: dni,
      mail: mail,
      habilitado: 0,
      tipo: "2"  # Asignar "2" para indicar que es un paseador
    )

    # Guardar el objeto en la base de datos
    if servicio.save

SELECT 1 AS one FROM "servicios" WHERE "servicios"."dni" IS NULL AND "servicios"."tipo" = ? AND "servicios"."habilitado" = ? LIMIT ?  [["tipo", "2"], ["habilitado", 0], ["LIMIT", 1]]
SELECT 1 AS one FROM "servicios" WHERE "servicios"."mail" = ? AND "servicios"."tipo" = ? AND "servicios"."habilitado" = ? LIMIT ?  [["mail", "asdasd@asdasd"], ["tipo", "2"], ["habilitado", 0], ["LIMIT", 1]]
SELECT 1 AS one FROM "servicios" WHERE "servicios"."mail" = ? AND "servicios"."id" != ? AND "servicios"."tipo" = ? AND "servicios"."habilitado" = ? LIMIT ?  [["mail", "asdasd@asdasd"], ["id", 15], ["tipo", "2"], ["habilitado", 0], ["LIMIT", 1]]
UPDATE "servicios" SET "horarios" = ?, "updated_at" = ? WHERE "servicios"."id" = ?  [["horarios", "lunes a viernasdasd"], ["updated_at", "2023-11-29 03:52:26.861999"], ["id", 15]]
---
  def actualizar_servicio
    # Validar la unicidad de DNI y correo electrónico solo si cambian
    if @servicio.dni != servicio_params[:dni] && Servicio.exists?(dni: servicio_params[:dni], tipo: @servicio.tipo, habilitado: 0)
      @servicio.errors.add(:dni, "ya está registrado como paseador") if @servicio.tipo == "2"
      @servicio.errors.add(:dni, "ya está registrado como cuidador") if @servicio.tipo == "1"
    end

    if @servicio.mail != servicio_params[:mail] && Servicio.exists?(mail: servicio_params[:mail], tipo: @servicio.tipo, habilitado: 0)
      @servicio.errors.add(:mail, "ya está registrado como paseador") if @servicio.tipo == "2"
      @servicio.errors.add(:mail, "ya está registrado como cuidador") if @servicio.tipo == "1"
    end

    if @servicio.errors.empty? && @servicio.update(servicio_params)

SELECT "servicios".* FROM "servicios" WHERE "servicios"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
---
  def set_servicio
    @servicio = Servicio.find(params[:id])