app/controllers/user_search_controller.rb

  def search
    if params[:dni].present?
      @users = User.where(dni: params[:dni], habilitado: true)
---
SELECT "users".* FROM "users" WHERE "users"."dni" = ? AND "users"."habilitado" = ?  [["dni", 44046020], ["habilitado", 1]]

  def perros
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 83], ["LIMIT", 1]]