app/models/historial_turno.rb

SELECT 1 AS one FROM "historial_turnos" WHERE "historial_turnos"."fecha_y_hora" = ? LIMIT ?  [["fecha_y_hora", "2024-02-12 13:45:00"], ["LIMIT", 1]]
---
  def fecha_y_hora_unicas
    if HistorialTurno.exists?(fecha_y_hora: fecha_y_hora)