app/models/perro.rb

SELECT 1 AS one FROM "perros" WHERE "perros"."nombre" = ? AND "perros"."user_id" = ? LIMIT ?  [["nombre", "perro de prueba 2"], ["user_id", 83], ["LIMIT", 1]]
---
  def nombre_unico_por_usuario
    # Verifica si hay algún otro perro del mismo usuario con el mismo nombre
    if Perro.exists?(nombre: nombre, user_id: user_id)