app/controllers/users/registrations_controller.rb

UPDATE "users" SET "nombre" = ?, "telefono" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["nombre", "tomas valentin"], ["telefono", "123456454"], ["updated_at", "2023-11-15 14:54:47.808078"], ["id", 86]]
---
    def update
      @user = current_user
      if @user.update_with_password(account_update_params)

UPDATE "users" SET "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["encrypted_password", "[FILTERED]"], ["updated_at", "2023-11-15 14:45:23.923684"], ["id", 86]]
---
    def update_password
      @user = current_user
      if current_user.update_with_password(password_params)

SELECT "users".* FROM "users" WHERE "users"."dni" = ? LIMIT ?  [["dni", 65656565656], ["LIMIT", 1]]
---
    def create
      existing_user = User.find_by(dni: sign_up_params[:dni])