app/controllers/users/registrations_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip", "permission_level", "dni", "nombre", "apellido", "fecha_nacimiento", "mail", "telefono", "rol_id", "created_at", "updated_at", "habilitado") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      build_resource(sign_up_params)

      resource.save

      yield resource if block_given?
      if resource.persisted?
        set_flash_message! :notice, :signed_up
        clean_up_passwords resource
        set_minimum_password_length
        respond_with resource, location: after_sign_up_path_for(resource)
      else
        clean_up_passwords resource
        set_minimum_password_length
        respond_with resource
      end

      if @user.save