app/controllers/users/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."dni" = ? LIMIT ?  [["dni", 45454545454], ["LIMIT", 1]]
---
    def create
      user = User.find_by(dni: params[:user][:dni])